{
  "header": {
    "home": "Home",
    "about": "About me",
    "skills": "How I can help you",
    "projects": "Projects",
    "contact": "Contact"
  },
  "footer": {
    "about": "About Me",
    "social": "Social Network",
    "language": "Language",
    "disclaimer": "Developed by @inzumer — or Nahuel Zamuner, if you prefer."
  },
  "presentation": {
    "title-one": "INZUMER",
    "title-two": "Software Engineer • Full Stack Developer @inzumer — or Nahuel Zamuner, if you prefer. Let’s work together."
  },
  "about": {
    "title": "About Me",
    "text-one": "I develop and optimize interfaces with a strong focus on accessibility and reliability. I have over 4 years of experience as a ",
    "text-two": ", actively contributing to technical and product decision-making from both frontend and backend perspectives. I focus on ensuring the performance, stability, and quality of every product I work on.",
    "text-three": " I’m driven by staying up to date with the latest technologies and taking on challenges that foster my professional growth. I enjoy being part of the full development cycle of products, supporting their evolution, and working with a long-term vision."
  },
  "skills": {
    "title": "How I can help you",
    "title-one": "Build web pages",
    "title-two": "Build cross-platform applications",
    "title-three": "Optimize and scale your existing platform",
    "title-four": "Audit your code and architecture",
    "title-five": "Integrate technologies and APIs",
    "description-one": "From concept to launch, I build fast, accessible, and optimized sites so you don’t lose customers to slow load times or poor usability.",
    "description-two": "A single codebase for web, iOS, and Android, reducing costs and time-to-market without compromising quality.",
    "description-three": "I enhance performance, security, and stability so your product can handle more users and deliver a seamless experience.",
    "description-four": "I identify bottlenecks, bad practices, and security risks so you can prevent costly issues before they arise.",
    "description-five": "I connect your product to external services (payments, authentication, analytics) to expand functionality without reinventing the wheel."
  },
  "projects": {
    "title": "My Projects",
    "text": "Here are some of the projects I’ve worked on."
  },
  "contact": {
    "title": "Say Hi",
    "text": "Do you have a question, a proposal, or just want to say hi? You can send me an email from here.",
    "email": "Email",
    "affair": "Subject",
    "message": "Message",
    "sending": "Sending...",
    "send": "Send message",
    "success": "Message sent successfully!",
    "error": "There was an error sending your message. Please try again.",
    "placeholder-email": "example@mail.com",
    "placeholder-affair": "Center a div.",
    "placeholder-message": "I need help centering a div, I just can't get it right."
  },
  "error": {
    "message": "Oops, something went wrong. Please try again later.",
    "button": "Back to home"
  },
  "belo": {
    "description": "Redesign and development of the new homepage and several pages of belo.app, a web application offering a modern experience. The project was built using TypeScript, Wouter, Next.js, and Tailwind CSS, with the implementation of translations into 3 languages via i18n, prioritizing an attractive user interface and optimal performance."
  },
  "store": {
    "description-one": "Developed a full-featured backend application using NestJS, connected to a MongoDB database, with a focus on clean architecture, test coverage (via Jest), CI/CD automation using GitHub Actions, and observability through Sentry.",
    "description-two": "The project showcases how to structure a scalable backend codebase with modularization, error handling, and integration testing. Pull requests are validated automatically with linters, audit tools, and coverage thresholds to ensure code quality and maintainability."
  },
  "payments": {
    "description-one": "I actively participated in the migration of Mercado Libre's checkout payment system to versions V2 and V2.1. This critical process enabled the smooth combination of multiple payment methods and the integration of smart discounts, modernizing the architecture to ensure scalability and the adoption of cutting-edge technologies.",
    "description-two": "Observability Implementation",
    "description-three": "Additionally, a key component of this transformation was the comprehensive implementation of observability. We incorporated New Relic, Datadog, and Kibana to gain deep system visibility. In Datadog, we implemented a traffic light system for real-time traffic measurement and control.",
    "description-four": "Monitoring and Debugging Optimization",
    "description-five": "We significantly improved logging in Kibana, making debugging and problem identification easier. In New Relic, we implemented an enriched logging system specifically designed to measure transaction performance and obtain detailed system behavior insights.",
    "description-six": "Impact on Robustness and Accessibility",
    "description-seven": "These improvements in observability, together with architecture updates and new 'invisible' functionalities for the user, were fundamental to the robustness and future of checkout on. Additionally, we enabled new features that expanded access to e-commerce for a larger number of people."
  },
  "smartcoupons": {
    "description": "We implemented 'Smart Coupons' in the Mercado Libre checkout to optimize the application of discounts and coupons. This project involved the complexity of managing multiple promotions, offering users a more intuitive and efficient experience when applying their benefits."
  },
  "regression": {
    "description-one": "This project involved the creation of comprehensive automated regressions for Mercado Libre's checkout. We automated the testing of over 100 end-to-end use cases, covering critical purchase process flows, combinations of payment methods, and discount combinations.",
    "description-two": "The solution was built using Playwright for automating user interactions and Cucumber for the collaborative definition and execution of test scenarios in a format understandable by both technical and non-technical teams.",
    "description-three": "In this way, we significantly reduced the number of bugs when implementing new features and during the weekly checkout releases."
  }
}
