{
  "header": {
    "home": "Home",
    "about": "About",
    "work": "Work",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact",
    "recommendations": "Recommendations"
  },
  "footer": {
    "about": "About Me",
    "social": "Social Network",
    "language": "Language",
    "disclaimer": "Developed by @inzumer — or Nahuel Zamuner, if you prefer."
  },
  "presentation": {
    "title-one": "Hi",
    "title-two": "I'm Nahuel Zamuner"
  },
  "about": {
    "title": "About Me",
    "text-one": "I develop and optimize interfaces, prioritizing accessibility and reliability. I have over 3 years of experience as a ",
    "text-two": ", actively participating in technical and product decision-making from the frontend side. I focus on ensuring the performance, stability, and quality of every product I work on. I’m driven by staying up-to-date with the latest frontend technologies and taking on challenges that push me to grow professionally."
  },
  "skills": {
    "title": "Principal Skills"
  },
  "work": {
    "title": "My Work",
    "text": "These are some of the companies I've contributed to."
  },
  "experience": {
    "title": "Professional Experience",
    "freelancer": "During my time as a freelance frontend developer, I focused on building web applications from scratch. I worked closely with UX/UI teams, actively participating in the definition of interfaces and user flows. In some projects, I also took on the role of 'designer', creating visual proposals from research to final wireframes. This experience allowed me to develop a comprehensive view of the product, combining design, development, and usability.",
    "meli-ssr": "Developed services, middlewares, and controllers for seamless API interaction. Maintained and documented a shared React component library using Storybook to support consuming teams. Implemented tests with Testing Library and conducted e2e testing with Cucumber and Playwright. Monitored deployments with New Relic and tracked performance metrics with Datadog.",
    "meli-jr": "Involvement in legacy projects using technologies such as Backbone.js, Handlebars, and Marionette.js. Debugging with Kibana. Development of new features with React. Interface styling with Sass."
  },
  "projects": {
    "title": "My Projects",
    "text": "Here are some of the projects I’ve worked on."
  },
  "contact": {
    "title": "Say Hi",
    "text": "Do you have a question, a proposal, or just want to say hi? You can send me an email from here.",
    "email": "Email",
    "affair": "Subject",
    "message": "Message",
    "sending": "Sending...",
    "send": "Send message",
    "success": "Message sent successfully!",
    "error": "There was an error sending your message. Please try again.",
    "placeholder-email": "example@mail.com",
    "placeholder-affair": "Center a div.",
    "placeholder-message": "I need help centering a div, I just can't get it right."
  },
  "recommendations": {
    "title": "Recommendations",
    "description": "Here are some recommendations from colleagues and clients.",
    "carlos-vizcaya": "Many times, he drove the team forward with a very proactive attitude, helping everyone stay aligned and meet our goals on time. He is one of those people who not only fulfills what is expected of them but is also always willing to lend a hand, unblock issues, and bring positive energy to the group. Working with him was truly a pleasure, and he would undoubtedly add tremendous value to any team.",
    "juliana-gonzalez": "He has solid knowledge in frontend development, especially in technologies like React, style management, and Node.js. In addition, he is very agile, analytical, organized, and communicates his ideas clearly and effectively, which makes working with him always smooth and enriching. Nahuel also brings a unique value: he has a broad perspective of both the product and the user, which elevates the quality of the solutions he develops and enhances the entire team.",
    "estefany-campos": "What I admire most about Nahuel is his ability to see challenges as opportunities for growth. He always approaches each task with a positive and proactive attitude, which not only makes him a valuable asset to any project but also inspires those around him."
  },
  "error": {
    "message": "Oops, something went wrong. Please try again later.",
    "button": "Back to home"
  },
  "belo": {
    "description": "Redesign and development of the new homepage and several pages of belo.app, a web application offering a modern experience. The project was built using TypeScript, Wouter, Next.js, and Tailwind CSS, with the implementation of translations into 3 languages via i18n, prioritizing an attractive user interface and optimal performance."
  },
  "payments": {
    "description-one": "I actively participated in the migration of Mercado Libre's checkout payment system to versions V2 and V2.1. This critical process enabled the smooth combination of multiple payment methods and the integration of smart discounts, modernizing the architecture to ensure scalability and the adoption of cutting-edge technologies.",
    "description-two": "Observability Implementation",
    "description-three": "Additionally, a key component of this transformation was the comprehensive implementation of observability. We incorporated New Relic, Datadog, and Kibana to gain deep system visibility. In Datadog, we implemented a traffic light system for real-time traffic measurement and control.",
    "description-four": "Monitoring and Debugging Optimization",
    "description-five": "We significantly improved logging in Kibana, making debugging and problem identification easier. In New Relic, we implemented an enriched logging system specifically designed to measure transaction performance and obtain detailed system behavior insights.",
    "description-six": "Impact on Robustness and Accessibility",
    "description-seven": "These improvements in observability, together with architecture updates and new 'invisible' functionalities for the user, were fundamental to the robustness and future of checkout on. Additionally, we enabled new features that expanded access to e-commerce for a larger number of people."
  },
  "smartcoupons": {
    "description": "We implemented 'Smart Coupons' in the Mercado Libre checkout to optimize the application of discounts and coupons. This project involved the complexity of managing multiple promotions, offering users a more intuitive and efficient experience when applying their benefits."
  },
  "regression": {
    "description-one": "This project involved the creation of comprehensive automated regressions for Mercado Libre's checkout. We automated the testing of over 100 end-to-end use cases, covering critical purchase process flows, combinations of payment methods, and discount combinations.",
    "description-two": "The solution was built using Playwright for automating user interactions and Cucumber for the collaborative definition and execution of test scenarios in a format understandable by both technical and non-technical teams.",
    "description-three": "In this way, we significantly reduced the number of bugs when implementing new features and during the weekly checkout releases."
  }
}
