{
  "header": {
    "home": "Inicio",
    "about": "Sobre mí",
    "skills": "En qué puedo ayudarte",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "footer": {
    "about": "Sobre mí",
    "social": "Redes Sociales",
    "language": "Lenguaje",
    "disclaimer": "Desarrollado por @inzumer — o Nahuel Zamuner, como prefieras."
  },
  "presentation": {
    "title-one": "INZUMER",
    "title-two": "Software Developer @inzumer — o Nahuel Zamuner, como prefieras."
  },
  "about": {
    "title": "Sobre Mí",
    "text-one": "Desarrollo y optimizo interfaces priorizando la accesibilidad y la fiabilidad. Cuento con más de 4 años de experiencia como ",
    "text-two": ", participando activamente en la toma de decisiones técnicas y de producto desde la perspectiva del frontend y backend. Me enfoco en garantizar el rendimiento, la estabilidad y la calidad de cada producto en el que trabajo.",
    "text-three": " Me motiva mantenerme actualizado con las últimas tecnologías y asumir desafíos que impulsen mi crecimiento profesional. Disfruto formar parte del desarrollo integral de los productos, acompañar su evolución y trabajar con una visión a largo plazo."
  },
  "skills": {
    "title": "En qué puedo ayudarte",
    "title-one": "Construir webs",
    "title-two": "Construir aplicaciones multiplataforma",
    "title-three": "Optimizar y escalar tu plataforma existente",
    "title-four": "Auditar tu código y arquitectura",
    "title-five": "Integrar tecnologías y APIs",
    "description-one": "Desde la idea hasta la implementación, creo sitios rápidos, accesibles y optimizados para que no pierdas clientes por tiempos de carga o errores de usabilidad.",
    "description-two": "Una sola base de código para web, iOS y Android, reduciendo costes y tiempo de lanzamiento sin sacrificar calidad.",
    "description-three": "Mejoro rendimiento, seguridad y estabilidad para que tu producto soporte más usuarios y ofrezca una experiencia fluida.",
    "description-four": "Detecto cuellos de botella, malas prácticas y riesgos de seguridad para que puedas prevenir problemas antes de que sean costosos.",
    "description-five": "Conecto tu producto con servicios externos (pagos, autenticación, análisis) para ampliar funcionalidades sin reinventar la rueda."
  },
  "projects": {
    "title": "Mis proyectos",
    "text": "Aquí puedes ver algunos de los proyectos en los que he trabajado."
  },
  "contact": {
    "title": "Salúdame",
    "text": "¿Tenés alguna pregunta, propuesta o simplemente querés saludar? Podés enviarme un mail desde acá.",
    "email": "Correo electrónico",
    "affair": "Asunto",
    "message": "Mensaje",
    "sending": "Enviando...",
    "send": "Enviar mensaje",
    "success": "¡Mensaje enviado!",
    "error": "Hubo un error al enviar el mensaje. Por favor, inténtalo de nuevo.",
    "placeholder-email": "example@mail.com",
    "placeholder-affair": "Centrar un div.",
    "placeholder-message": "Necesito ayuda con un div, no puedo centrarlo."
  },
  "error": {
    "message": "Ups, algo salió mal. Por favor, intentá de nuevo más tarde.",
    "button": "Volver al inicio"
  },
  "store": {
    "description-one": "Desarrollé una aplicación backend completa con NestJS, conectada a una base de datos MongoDB, con énfasis en una arquitectura limpia, cobertura de pruebas (mediante Jest), automatización de CI/CD con GitHub Actions y observabilidad mediante Sentry.",
    "description-two": "El proyecto muestra cómo estructurar una base de código backend escalable con modularización, gestión de errores y pruebas de integración. Las solicitudes de extracción se validan automáticamente con linters, herramientas de auditoría y umbrales de cobertura para garantizar la calidad y la mantenibilidad del código."
  },
  "belo": {
    "description": "Rediseño y desarrollo del nuevo home y diversas páginas de belo.app, una aplicación web que ofrece una experiencia moderna. El proyecto se construyó utilizando TypeScript, Wouter, Next.js y Tailwind CSS, la implementación de traducciones a 3 idiomas mediante i18n, priorizando una interfaz de usuario atractiva, un rendimiento óptimo."
  },
  "payments": {
    "description-one": "Participé activamente en la migración del sistema de pagos del checkout de Mercado Libre hacia las evoluciones V2 y V2.1. Este proceso crítico habilitó la combinación fluida de múltiples métodos de pago y la integración de descuentos inteligentes, modernizando la arquitectura para asegurar su escalabilidad y la adopción de tecnologías de vanguardia.",
    "description-two": "Implementación de Observabilidad",
    "description-three": "Adicionalmente, un componente clave de esta transformación fue la implementación integral de observabilidad. Incorporamos New Relic, Datadog y Kibana para obtener una visibilidad profunda del sistema. En Datadog, implementamos un semafoo para la medición y el control del tráfico en tiempo real.",
    "description-four": "Optimización del Monitoreo y Debugging",
    "description-five": "Mejoramos significativamente el loggeo en Kibana, facilitando el debugging y la identificación de problemas. En New Relic, implementamos un sistema de loggeo enriquecido diseñado específicamente para medir el performance de las transacciones y obtener insights detallados del comportamiento del sistema.",
    "description-six": "Impacto en la Robustez y el Acceso",
    "description-seven": "Estas mejoras en la observabilidad, junto con las actualizaciones de la arquitectura y las nuevas funcionalidades 'invisibles' para el usuario, fueron fundamentales para la robustez y el futuro del checkout on. Además, habilitamos nuevas funcionalidades que expandieron el acceso al comercio electrónico para un mayor número de personas."
  },
  "smartcoupons": {
    "description": "Implementamos 'Smart Coupons' en el checkout de Mercado Libre para optimizar la aplicación de descuentos y cupones. Este proyecto tuvo la complejidad de gestionar múltiples promociones, ofreciendo a los usuarios una experiencia más intuitiva y eficiente al momento de aplicar sus beneficios."
  },
  "regression": {
    "description-one": "Este proyecto consistió en la creación de regresiones automáticas integral para el checkout de Mercado Libre. Automatizamos la prueba de más de 100 casos de uso end-to-end, abarcando los flujos críticos del proceso de compra, combinaciones de medios de pago y combinaciones de descuentos.",
    "description-two": "La solución se construyó utilizando Playwright para la automatización de la interacción del usuario y Cucumber para la definición colaborativa y la ejecución de los escenarios de prueba en un formato comprensible para equipos técnicos y no técnicos.",
    "description-three": "De esta forma reducimos considerablemente la cantidad de bugs al implementar nuevas features y en las releases semanales del checkout."
  }
}
