{
  "header": {
    "home": "Home",
    "about": "Chi sono",
    "work": "Lavoro",
    "experience": "Esperienza",
    "projects": "Progetti",
    "contact": "Contatto",
    "recommendations": "Raccomandazioni"
  },
  "footer": {
    "about": "Chi sono",
    "social": "Reti sociali",
    "language": "Lingua",
    "disclaimer": "Sviluppato da @inzumer — o Nahuel Zamuner, se preferisci."
  },
  "presentation": {
    "title-one": "Ciao",
    "title-two": "sono Nahuel Zamuner"
  },
  "about": {
    "title": "Su Di Me",
    "text-one": "Sviluppo e ottimizzo interfacce, dando priorità all’accessibilità e all’affidabilità. Ho più di 3 anni di esperienza come ",
    "text-two": ", partecipando attivamente alle decisioni tecniche e di prodotto dal lato frontend. Mi concentro nel garantire performance, stabilità e qualità in ogni progetto a cui partecipo. Sono motivato a restare aggiornato con le tecnologie del mondo frontend e ad affrontare sfide che mi aiutino a crescere professionalmente."
  },
  "skills": {
    "title": "Competenze Principali"
  },
  "work": {
    "title": "Il Mio Lavoro",
    "text": "Queste sono alcune delle aziende a cui ho contribuito."
  },
  "experience": {
    "title": "Esperienza Professionale",
    "freelancer": "Durante la mia esperienza come sviluppatore frontend freelance, mi sono concentrato sulla creazione di applicazioni web da zero. Ho collaborato strettamente con i team UX/UI, partecipando attivamente alla definizione delle interfacce e dei flussi utente. In alcuni progetti ho anche assunto il ruolo di \"designer\", realizzando proposte visive dalla fase di ricerca fino ai wireframe finali. Questa esperienza mi ha permesso di sviluppare una visione completa del prodotto, combinando design, sviluppo e usabilità.",
    "meli-ssr": "Ho sviluppato servizi, middleware e controller per facilitare l'interazione con le API. Mi sono occupato della manutenzione e documentazione di una libreria condivisa di componenti React, rendendola accessibile tramite Storybook ai team utilizzatori. Ho implementato test con Testing Library e test end-to-end con Cucumber e Playwright. Ho monitorato i deploy con New Relic e analizzato le metriche delle performance con Datadog.",
    "meli-jr": "Partecipazione a progetti legacy utilizzando tecnologie come Backbone.js, Handlebars e Marionette.js. Debugging con Kibana. Sviluppo di nuove funzionalità con React. Styling delle interfacce con Sass."
  },
  "projects": {
    "title": "I miei progetti",
    "text": "Ecco alcuni dei progetti a cui ho lavorato."
  },
  "contact": {
    "title": "Dì ciao",
    "text": "Hai una domanda, una proposta o vuoi semplicemente salutare? Puoi scrivermi una mail da qui.",
    "email": "Email",
    "affair": "Oggetto",
    "message": "Messaggio",
    "sending": "Invio in corso...",
    "send": "Invia messaggio",
    "success": "Messaggio inviato con successo!",
    "error": "Si è verificato un errore durante l'invio del messaggio. Riprova, per favore.",
    "placeholder-email": "example@mail.com",
    "placeholder-affair": "Centrare un div.",
    "placeholder-message": "Ho bisogno di aiuto per centrare un div, non ci riesco."
  },
  "recommendations": {
    "title": "Raccomandazioni",
    "description": "Ecco alcune raccomandazioni da parte di colleghi e clienti.",
    "carlos-vizcaya": "Molte volte ha spinto il team in avanti con un atteggiamento molto proattivo, aiutando tutti a rimanere allineati e a raggiungere gli obiettivi nei tempi previsti. È una di quelle persone che non solo soddisfano le aspettative, ma sono anche sempre pronte a dare una mano, risolvere blocchi e portare energia positiva al gruppo. Lavorare con lui è stato davvero un piacere, e senza dubbio apporterebbe un enorme valore a qualsiasi team.",
    "juliana-gonzalez": "Ha una solida conoscenza nello sviluppo frontend, in particolare in tecnologie come React, gestione degli stili e Node.js. Inoltre, è molto agile, analitico, organizzato e comunica le sue idee in modo chiaro ed efficace, rendendo il lavoro con lui sempre fluido ed arricchente. Nahuel apporta anche un valore differenziale: ha una visione ampia sia del prodotto che dell'utente, il che eleva la qualità delle soluzioni che sviluppa e valorizza l'intero team.",
    "estefany-campos": "Quello che ammiro di più di Nahuel è la sua capacità di vedere le sfide come opportunità di crescita. Affronta sempre ogni compito con un atteggiamento positivo e proattivo, il che lo rende non solo una risorsa preziosa per qualsiasi progetto, ma anche una fonte di ispirazione per chi lo circonda."
  },
  "error": {
    "message": "Ops, qualcosa è andato storto. Riprova più tardi.",
    "button": "Torna alla home"
  },
  "belo": {
    "description": "Redesign e sviluppo della nuova homepage e di varie pagine di belo.app, un'applicazione web che offre un'esperienza moderna. Il progetto è stato realizzato utilizzando TypeScript, Wouter, Next.js e Tailwind CSS, con l'implementazione delle traduzioni in 3 lingue tramite i18n, dando priorità a un'interfaccia utente accattivante e a prestazioni ottimali."
  },
  "payments": {
    "description-one": "Ho partecipato attivamente alla migrazione del sistema di pagamenti del checkout di Mercado Libre verso le versioni V2 e V2.1. Questo processo critico ha permesso la combinazione fluida di molteplici metodi di pagamento e l'integrazione di sconti intelligenti, modernizzando l'architettura per garantirne la scalabilità e l'adozione di tecnologie all'avanguardia.",
    "description-two": "Implementazione dell'Osservabilità",
    "description-three": "Inoltre, un elemento chiave di questa trasformazione è stata l'implementazione completa dell'osservabilità. Abbiamo integrato New Relic, Datadog e Kibana per ottenere una visibilità profonda del sistema. In Datadog, abbiamo implementato un sistema a semaforo per la misurazione e il controllo del traffico in tempo reale.",
    "description-four": "Ottimizzazione del Monitoraggio e del Debugging",
    "description-five": "Abbiamo migliorato significativamente il sistema di log su Kibana, facilitando il debugging e l'identificazione dei problemi. Su New Relic, abbiamo implementato un sistema di log arricchito progettato specificamente per misurare le performance delle transazioni e ottenere approfondimenti dettagliati sul comportamento del sistema.",
    "description-six": "Impatto sulla Robustezza e sull'Accessibilità",
    "description-seven": "Questi miglioramenti nell'osservabilità, insieme agli aggiornamenti architetturali e alle nuove funzionalità 'invisibili' per l'utente, sono stati fondamentali per la robustezza e il futuro del checkout on. Inoltre, abbiamo abilitato nuove funzionalità che hanno ampliato l'accesso all'e-commerce a un numero maggiore di persone."
  },
  "smartcoupons": {
    "description": "Abbiamo implementato i 'Smart Coupons' nel checkout di Mercado Libre per ottimizzare l'applicazione di sconti e coupon. Questo progetto ha comportato la complessità di gestire più promozioni, offrendo agli utenti un'esperienza più intuitiva ed efficiente nell'applicazione dei loro vantaggi."
  },
  "regression": {
    "description-one": "Questo progetto ha riguardato la creazione di regressioni automatiche complete per il checkout di Mercado Libre. Abbiamo automatizzato il testing di oltre 100 casi d'uso end-to-end, coprendo i flussi critici del processo di acquisto, le combinazioni di metodi di pagamento e le combinazioni di sconti.",
    "description-two": "La soluzione è stata realizzata utilizzando Playwright per l'automazione delle interazioni dell'utente e Cucumber per la definizione collaborativa e l'esecuzione degli scenari di test in un formato comprensibile sia ai team tecnici che a quelli non tecnici.",
    "description-three": "In questo modo abbiamo ridotto significativamente il numero di bug durante l'implementazione di nuove funzionalità e nei rilasci settimanali del checkout."
  }
}
